---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarInSystem.GetHostId
source: html/fe7a895a-5ea3-64ba-a997-dead0c206d5a.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.GetHostId Method

The element that contains the rebar.

## Syntax (C#)
```csharp
public ElementId GetHostId()
```

## Returns
The element that the rebar object belongs to, such as a structural
 wall, floor, foundation, beam, brace or column.